controllers/AdministrationController.php

SELECT * FROM `employee` WHERE `employee_id`=10406
---
    public function actionApproval(){
        $id = Yii::$app->user->getId();
        $query = Employee::findOne($id);
        $model = new Employee(['scenario'=>'update_myaccount']);
        if ($model->load(Yii::$app->getRequest()->post()) && $model->getUpdateMyApproval($id)){
            Yii::$app->session->setFlash('msg',Yii::t('app/message','msg update approval successfully'));
        }
        $query = Employee::findOne($id);