controllers/HolidayController.php

    public function actionForm($id = 0){
        $model = new \app\models\Holiday(['scenario' => $id ? 'update' : 'save']);
        $query = $model->findOne($id);
---
SELECT * FROM `holiday` WHERE `holiday_id`='37'

    public function actionView($id){
        $model = new \app\models\Holiday();
        return $this->render('holiday_view',[
            'title' => Yii::t('app','holiday view'),
            'model' => $model->findOne($id)
        ]);
---
SELECT * FROM `holiday` WHERE `holiday_id`='37'

    public function actionDelete($id){
        $exists = \app\models\Holiday::findOne($id);
        if($exists){
            \app\models\Holiday::deleteAll('holiday_id = :id',[':id' => $id]);
---
SELECT * FROM `holiday` WHERE `holiday_id`='39'
DELETE FROM `holiday` WHERE holiday_id = '39'