models/Employee.php

    public static function getEmployeeList($data = array()){
    	$lists = [];
    	$models = Employee::find()
    	->from('employee e')
    	->join('inner join','sys_user su','su.employee_id=e.employee_id')
    	->orderBy('e.EmployeeFirstname ASC,e.EmployeeMiddleName ASC,e.EmployeeLastName ASC')
    	->where(['su.user_active'=>1]);

    	if(isset($data['position']))
    		$models = $models->where(['EmployeeTitle' => $data['position']]);
    	$models = $models->all();
---
SELECT `e`.* FROM `employee` `e` inner join `sys_user` `su` ON su.employee_id=e.employee_id WHERE `su`.`user_active`=1 ORDER BY `e`.`EmployeeFirstname`, `e`.`EmployeeMiddleName`, `e`.`EmployeeLastName`

    public static function getEmployee($employee_id){
    	$Employee = Employee::find()
    	->select(["e.*","CONCAT(em.EmployeeFirstName,' ',em.EmployeeLastName) as manager_approval","em.EmployeeEmail as manager_email",
    	"DATE_FORMAT(e.EmployeeHireDate,'%d/%m/%Y') as EmployeeHireDate",
    	"CONCAT(eh.EmployeeFirstName,' ',eh.EmployeeLastName) as hrd_approval","eh.EmployeeEmail as hrd_email",
    	"CONCAT(ep.EmployeeFirstName,' ',ep.EmployeeLastName) as partner_approval","ep.EmployeeEmail as partner_email"])
    	->from('employee e')
    	->join('left join','employee em','em.employee_id=e.EmployeeLeaveManager')
    	->join('left join','employee eh','eh.employee_id=e.EmployeeLeaveHRD')
    	->join('left join','employee ep','ep.employee_id=e.EmployeeLeavePartner')
    	->where(['e.employee_id' => $employee_id])
    	->one();
---
SELECT `e`.*, CONCAT(em.EmployeeFirstName,' ',em.EmployeeLastName) as manager_approval, `em`.`EmployeeEmail` AS `manager_email`, DATE_FORMAT(e.EmployeeHireDate,'%d/%m/%Y') as EmployeeHireDate, CONCAT(eh.EmployeeFirstName,' ',eh.EmployeeLastName) as hrd_approval, `eh`.`EmployeeEmail` AS `hrd_email`, CONCAT(ep.EmployeeFirstName,' ',ep.EmployeeLastName) as partner_approval, `ep`.`EmployeeEmail` AS `partner_email` FROM `employee` `e` left join `employee` `em` ON em.employee_id=e.EmployeeLeaveManager left join `employee` `eh` ON eh.employee_id=e.EmployeeLeaveHRD left join `employee` `ep` ON ep.employee_id=e.EmployeeLeavePartner WHERE `e`.`employee_id`=10670