models/Employee.php

    public function getEmployeeLeaveData($params){
        $query = Employee::find()
        ->select(["e.employee_id","CONCAT(e.EmployeeFirstname,' ',e.EmployeeMiddleName,' ',EmployeeLastName) as EmployeeName",
                  "e.EmployeeID","DATE_FORMAT(e.EmployeeHireDate,'%d/%m/%Y') as EmployeeHireDate","e.EmployeeTitle",
                  "DATE_FORMAT(EmployeeLeaveDate,'%d/%m/%Y') as EmployeeLeaveDate","IF(TO_DAYS(CURDATE())-TO_DAYS(EmployeeLeaveDate)>364,'Must Update','Updated') as leave_status",
                  "e.EmployeeLeaveTotal","e.EmployeeLeaveUse","(e.EmployeeLeaveTotal-e.EmployeeLeaveUse) as EmployeeLeaveOver"])
        ->from('employee e')
        ->join('inner join','sys_user u','u.employee_id=e.employee_id')
---
SELECT `e`.*, CONCAT(em.EmployeeFirstName,' ',em.EmployeeLastName) as manager_approval, `em`.`EmployeeEmail` AS `manager_email`, CONCAT(eh.EmployeeFirstName,' ',eh.EmployeeLastName) as hrd_approval, `eh`.`EmployeeEmail` AS `hrd_email`, CONCAT(ep.EmployeeFirstName,' ',ep.EmployeeLastName) as partner_approval, `ep`.`EmployeeEmail` AS `partner_email` FROM `employee` `e` left join `employee` `em` ON em.employee_id=e.EmployeeLeaveManager left join `employee` `eh` ON eh.employee_id=e.EmployeeLeaveHRD left join `employee` `ep` ON ep.employee_id=e.EmployeeLeavePartner WHERE `e`.`employee_id`=10406

    public static function findIdentity($id){
        return static::findOne(['employee_id' => $id]);
---
SELECT * FROM `employee` WHERE `employee_id`=10406

    public function getUserSingleData(){
        if ($this->_user === false) {
            $this->_user = Employee::findByIdentity($this->EmployeeID,$this->passtext);
---
SELECT * FROM `employee` WHERE `employee_id`=10406

    public static function getEmployeeGroupDropdownList($department_id=0,$acl){
        $arr = [];
        $query = Employee::find()
        ->from('employee e')
        ->join('inner join','sys_user su','su.employee_id=e.employee_id')
        ->where(['su.user_active'=>1])
        ->orderBy('e.EmployeeFirstname,e.EmployeeMiddleName,e.EmployeeLastName');

        if($acl=='041')
            $query->orWhere(['e.project_title' => '03','e.project_title' => '041']);
        else
            $query->andWhere(['e.project_title' => $acl]);

        $query = $query->all();
---
SELECT `e`.* FROM `employee` `e` inner join `sys_user` `su` ON su.employee_id=e.employee_id WHERE (`su`.`user_active`=1) AND (`e`.`project_title`='03') ORDER BY `e`.`EmployeeFirstname`, `e`.`EmployeeMiddleName`, `e`.`EmployeeLastName`