models/Holiday.php

SELECT `holiday_id`, DATE_FORMAT(holiday_date,'%d/%m/%Y') as holiday_date, `holiday_type`, `holiday_desc` FROM `holiday` WHERE DATE_FORMAT(holiday_date,'%d/%m/%Y')='01/01/2016'
---
    public function getSingleHolidayDataByDate($date){
        return Holiday::find()
        ->select(['holiday_id','DATE_FORMAT(holiday_date,\'%d/%m/%Y\') as holiday_date','holiday_type','holiday_desc'])
        ->where(['DATE_FORMAT(holiday_date,\'%d/%m/%Y\')' => $date])
        ->one();

SELECT * FROM `holiday` WHERE `holiday_id`='41'
INSERT INTO `holiday` (`holiday_date`, `holiday_type`, `holiday_desc`) VALUES ('2016-02-27', 'Libur', 'Test')
---
    public function getSaveRequest($id = 0 ){
        if($this->validate()){
            $model = new Holiday();
            if($id) $model =  $model->findOne($id);
            $model->holiday_date = preg_replace('!(\d+)/(\d+)/(\d+)!', '\3-\2-\1',$this->holiday_date);
            $model->holiday_type = $this->holiday_type;
            $model->holiday_desc = $this->holiday_desc;
            if($id)
            	$model->update();
            else
            	$model->insert();