models/Leaves.php

SELECT * FROM `employee` WHERE EmployeeID
---
            $model->leave_created_date = date('Y-m-d H:i:s');

            if($status==TRUE){
                $setting = \app\models\Employee::findOne($employee_id);