models/Leaves.php

    public function getDetailView($id) {
    	return Leaves::find()
    	->select(["DATE_FORMAT(leave_date,'%d %M %Y') as leave_date","leave_total","leave_range","leave_description","leave_address",
    	"DATE_FORMAT(leave_date_from,'%d %M %Y') as leave_date_from","DATE_FORMAT(leave_date_to,'%d %M %Y') as leave_date_to",
    	"leave_saldo_total","leave_saldo_balanced","employee_id","leave_status",
    	"(CASE WHEN leave_status = ".self::$request." THEN '".Yii::t('app','request')."'
			WHEN leave_status = ".self::$approve_manager." THEN '".Yii::t('app','approved by manager')."'
    		WHEN leave_status = ".self::$inapprove_manager." THEN '".Yii::t('app','inapproved by manager')."'
    		WHEN leave_status = ".self::$approve_hrd." THEN '".Yii::t('app','approved by hrd')."'
    		WHEN leave_status = ".self::$inapprove_hrd." THEN '".Yii::t('app','inapproved by hrd')."'
    		WHEN leave_status = ".self::$approve_partner." THEN '".Yii::t('app','approved by partner')."'
    		WHEN leave_status = ".self::$inapprove_partner." THEN '".Yii::t('app','inapproved by partner')."'
    	END) as leave_status_string","(CASE WHEN leave_type = ".self::$cuti_bersama." THEN '".Yii::t('app','cuti bersama')."'
		    		WHEN leave_type = ".self::$cuti_tahunan." THEN '".Yii::t('app','cuti tahunan')."'
		    		WHEN leave_type = ".self::$cuti_tambahan." THEN '".Yii::t('app','cuti tambahan')."'
		    		WHEN leave_type = ".self::$cuti_khusus." THEN '".Yii::t('app','cuti khusus')."'
		    		WHEN leave_type = ".self::$cuti_izin." THEN '".Yii::t('app','izin diklasifikan Cuti')."'
		    	END) as leave_type_string",
    	"(CASE WHEN leave_status = 1 THEN '".Yii::t('app','timesheet')."' ELSE '".Yii::t('app','leave')."' END) as leave_source_string"
    	])
    	->from('leaves l')
    	->where(['l.leave_id' => $id])
    	->one();
---
SELECT DATE_FORMAT(leave_date,'%d %M %Y') as leave_date, `leave_total`, `leave_range`, `leave_description`, `leave_address`, DATE_FORMAT(leave_date_from,'%d %M %Y') as leave_date_from, DATE_FORMAT(leave_date_to,'%d %M %Y') as leave_date_to, `leave_saldo_total`, `leave_saldo_balanced`, `employee_id`, `leave_status`, (CASE WHEN leave_status = 5 THEN 'Request'
			WHEN leave_status = 4 THEN 'Approved By Manager'
    		WHEN leave_status = 14 THEN 'Inapproved By Manager'
    		WHEN leave_status = 3 THEN 'Approved By HRD'
    		WHEN leave_status = 13 THEN 'Inapproved By HRD'
    		WHEN leave_status = 2 THEN 'Approved By Partner'
    		WHEN leave_status = 12 THEN 'Inapproved By Partner'	
    	END) as leave_status_string, (CASE WHEN leave_type = 1 THEN 'Cuti Bersama'
		    		WHEN leave_type = 2 THEN 'Cuti Tahunan'
		    		WHEN leave_type = 3 THEN 'cuti tambahan'
		    		WHEN leave_type = 4 THEN 'cuti khusus'
		    		WHEN leave_type = 5 THEN 'izin diklasifikan Cuti'
		    	END) as leave_type_string, (CASE WHEN leave_status = 1 THEN 'Timesheet' ELSE 'Leave' END) as leave_source_string FROM `leaves` `l` WHERE `l`.`leave_id`='596'